# IsSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxXYZ..::..IsSet Property
BoundingBoxXYZ Class See Also
---
Indicates whether the bounding box is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSet { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSet As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSet {
	bool get ();
}
```

# Remarks
Bounding box is considered set when it contains at least one point and "Enabled" is set to "true".
# See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace